package com.javarush.test.level01.lesson05.task01;

/* Должна компилироваться
Внесите изменения в программу, чтобы переменная s была равна 5, t была равна 6, а x равна 7.
Программа должна компилироваться.
*/
public class Solution
{
    public static void main(String[] args)
    {
        int s = 5;
        int t = 6;
        int x = 7;
    }
}

/* Output:

✓ Программа скомпилировалась без ошибок.
✓ Программа прошла все тесты. Вы выполнили задание! 
  Вот что программа вывела на экран за время работы:
*/
