package com.javarush.test.level02.lesson03.task03;

/* Кодим на Java
Напиши программу, которая выводит на экран надпись: «Будешь плохо кодить, придет Java и съест твою память».
*/
public class Solution
{
    public static void main(String[] args)
    {
        System.out.println("Будешь плохо кодить, придет Java и съест твою память");
    }
}

/* Output:

✓ Программа скомпилировалась без ошибок.
✓ Программа прошла все тесты. Вы выполнили задание! 
  Вот что программа вывела на экран за время работы:

Будешь плохо кодить, придет Java и съест твою память
*/
