package com.javarush.test.level00.lesson02.task01;

/* Быть программистом - круто!
Напиши программу, которая выводит на экран надпись: «Я думаю, быть программистом - это круто».
Пример вывода на экран:
Я думаю, быть программистом - это круто
*/

public class Solution
{
    public static void main(String[] args)
    {
        System.out.println("Я думаю, быть программистом - это круто");
    }
}

/* Output: 

✓ Программа скомпилировалась без ошибок.
✓ Программа прошла все тесты. Вы выполнили задание! 
  Вот что программа вывела на экран за время работы:

Я думаю, быть программистом - это круто
*/
