package com.javarush.test.level00.lesson07.task01;

/* Это не баг, это фича.
Напиши программу, которая выводит на экран надпись «Это не баг, это фича.».
Пример вывода на экран:
Это не баг, это фича.
*/
public class Solution
{
    public static void main(String[] args)
    {
        System.out.println("Это не баг, это фича.");
    }
}

/* Output:

✓ Программа скомпилировалась без ошибок.
✓ Программа прошла все тесты. Вы выполнили задание! 
  Вот что программа вывела на экран за время работы:

Это не баг, это фича.
*/
